backend-api/app/Controllers/Barang.php

SELECT `b`.*, `k`.`nama_kategori`, `s`.`nama_supplier`
FROM `barang` `b`
JOIN `kategori` `k` ON `k`.`id_kategori` = `b`.`id_kategori`
LEFT JOIN `supplier` `s` ON `s`.`id_supplier` = `b`.`id_supplier`
---
    public function index()
    {
        $data = $this->db->table('barang b')
            ->select('
                b.*,
                k.nama_kategori,
                s.nama_supplier
            ')
            ->join('kategori k', 'k.id_kategori = b.id_kategori')
            ->join('supplier s', 's.id_supplier = b.id_supplier', 'left')
            ->get()
            ->getResultArray();

UPDATE `barang` SET `id_kategori` = '2', `id_supplier` = '2', `nama_barang` = 'Kopi ABC Susu', `satuan` = 'sachet', `stok` = 10, `stok_minimum` = '20', `lokasi` = 'Rak B2'
WHERE `id_barang` = '12'
---
    public function update($id = null)
    {
        $input = $this->request->getJSON(true);
        log_message('error', json_encode($input));

        $data = [
            'id_kategori'   => $input['id_kategori'],
            'id_supplier'   => $input['id_supplier'],
            'nama_barang'   => $input['nama_barang'],
            'satuan'        => $input['satuan'],
            'stok'          => $input['stok'],
            'stok_minimum'  => $input['stok_minimum'],
            'lokasi'        => $input['lokasi']
        ];

        $this->db->table('barang')
            ->where('id_barang', $id)
            ->update($data);