backend-api/app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data = $this->db->table('kategori')->get()->getResultArray();