backend-api/app/Controllers/Supplier.php

    public function index()
    {
        $data = $this->db->table('supplier')
            ->orderBy('nama_supplier', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `supplier`
ORDER BY `nama_supplier` ASC