backend-api/app/Controllers/TransaksiBarang.php

SELECT `t`.*, `b`.`nama_barang`, `u`.`nama` as `nama_user`
FROM `transaksi_barang` `t`
JOIN `barang` `b` ON `b`.`id_barang` = `t`.`id_barang`
JOIN `users` `u` ON `u`.`id_user` = `t`.`id_user`
ORDER BY `t`.`tanggal` DESC
---
    public function index()
    {
        $data = $this->db->table('transaksi_barang t')
            ->select('t.*, b.nama_barang, u.nama as nama_user')
            ->join('barang b', 'b.id_barang = t.id_barang')
            ->join('users u', 'u.id_user = t.id_user')
            ->orderBy('t.tanggal', 'DESC')
            ->get()->getResultArray();